{
    "info": {
        "name": "Code",
        "filters": ["frontend", "fullstack", "mobile"],
        "blurb": "This is a collection of all the software development and computer science work I have done.  A lot of my experience lies in React and Typescript, writing frontend and full-stack code.  To see my work in design, take a look at my Design Portfolio!"
    },
    "entries": [
        {
            "entryId": 6,
            "name": "Renny Gong's Website",
            "blurb": "I worked with this client for several months, iterating designs to best match their personality and writing achievements. We aggreed upon the design for this website, which I mocked up in Figma. I then developed the website as a static frontend using Typescript, React, and Tailwind CSS. Working with the client, I created and doocumented a procedure for the client to add to his portfolio and to deploy those changes in a non-technical-friendly process.",
            "url": "rennygong.com",
            "skills": [
                "React",
                "React-Native",
                "Implementing Design",
                "Typescript",
                "MapView",
                "Expo SDK"
            ],
            "imgSlugs": ["rennygong1.png", "rennygong2.png"]
        },
        {
            "entryId": 1,
            "name": "HotSpot",
            "blurb": "I built this app from scratch, and from no knowledge of mobile development. From following best React practices learned from The Vendry, alongside numerous online tutorials, I built this using React Native and Expo Go for a final project for UI Design. This app collects suggestions and favorite places from your friends, sorts them based on several metrics before displaying them for the user to scroll through. This app implements ratings, reviews, and location data.",
            "url": "https://github.com/andyjwang19/HotSpot",
            "skills": [
                "React",
                "React-Native",
                "Implementing Design",
                "Typescript",
                "MapView",
                "Expo SDK"
            ],
            "imgSlugs": ["hotspotCode_1.png", "hotspotCode_2.png", "hotspotCode_3.png"]
        },
        {
            "entryId": 2,
            "name": "Personal Website Frontend",
            "blurb": "This is the website you are currently on! I built this website using React and Typescript. I wanted to learn a new technology as well, so I decided to implement Tailwind CSS for styling. I set up a different node scripts, including a deploy script that automatically builds and publishes the changes onto Git Pages.",
            "url": "https://github.com/andyjwang19/PersonalSite",
            "skills": ["React", "Implementing Design", "Typescript", "Tailwind CSS", "HTML/CSS"],
            "imgSlugs": ["placeholder"]
        },
        {
            "entryId": 3,
            "name": "Personal Website Backend",
            "blurb": "I created a backend for my personal website to serve data on various portfolio elements. This was written in NodeJS and ExpressJS, and hosted on AWS EC2. This backend was connected to the front end through a REST API, called through HTTP requests.",
            "url": "https://github.com/andyjwang19/PersonalSite/tree/main/server",
            "skills": [],
            "imgSlugs": ["placeholder"]
        },
        {
            "entryId": 4,
            "name": "Accolades for The Vendry",
            "blurb": "As a capstone project for my Internship at The Vendry, I added an Accolade System to their search. The Vendry has several services, the primary one being their venue search, which allows hosts and companies to look through a carefully curated dataset of venues. An important aspect of the users' evaluations of a particular venue would be any awards the venue has won. This is the service I added. I worked on the full-stack of this service, from creating and designing the database to store necessary values, writing API paths for the frontend to get the values from the backend, to a front end display. The Frontend display included an option in the search bar for all users to see, as well as an inward facing interface for admins to manipulate the database.",
            "skills": ["React", "APIs", "Full-Stack", "Implementing Design", "Typescript"],
            "imgSlugs": ["placeholder"]
        },
        {
            "entryId": 5,
            "name": "Website Portfolio Engine",
            "blurb": "This element of my personal website allows me to automate the layout of my portfolios. The different elements are sorted in Small, Medium, and Large based on the length of the blurbs, before the algorithm mixes and matches to form an interesting layout.",
            "skills": ["Algorithm Design", "React", "Typescript", "Tailwind CSS", "HTML/CSS"],
            "imgSlugs": ["placeholder"]
        }
    ]
}
