{
    "info": {
        "name": "Code",
        "filters": ["frontend", "fullstack", "mobile"],
        "blurb": "This is a collection of all the software development and computer science work I have done.  A lot of my experience lies in React and Typescript, writing frontend and full-stack code.  To see my work in design, take a look at my Design Portfolio!"
    },
    "entries": [
        {
            "entryId": 6,
            "name": "Renny Gong's Website",
            "blurb": "I worked with this client for several months, iterating designs to best match their personality and writing achievements. We aggreed upon the design for this website, which I mocked up in Figma. I then developed the website as a static frontend using Typescript, React, and Tailwind CSS. Working with the client, I created and doocumented a procedure for the client to add to his portfolio and to deploy those changes in a non-technical-friendly process.",
            "url": "https://rennygong.com",
            "skills": [
                "React",
                "React-Native",
                "Implementing Design",
                "Typescript",
                "MapView",
                "Expo SDK"
            ],
            "imgSlugs": ["rennygong1.png", "rennygong2.png"]
        },
        {
            "entryId": 1,
            "name": "HotSpot",
            "blurb": "Hotspot is a cross-platform app I developed. After conducting user interviews and identifying pain points with filtering through venues, my team and I (shout-out Rachel Michelson, Tejasri V., and Theo M.!) discovered that people really trusted word-of-mouth from friends and acquaintances. Thus, I created this full-stack app that collects reviews for restaurants and other third-spaces from friends and displays them on a map. I wrote the frontend using React Native, MapView, Expo SDK, and the backend with NodeJS and MySQL. ",
            "url": "https://github.com/andyjwang19/HotSpot",
            "skills": [
                "React",
                "React-Native",
                "Implementing Design",
                "Typescript",
                "MapView",
                "Expo SDK"
            ],
            "imgSlugs": ["hotspotCode_1.png", "hotspotCode_2.png", "hotspotCode_3.png"]
        },
        {
            "entryId": 7,
            "name": "Chef Mike's Alert Site",
            "blurb": "I love the Grandma Sub at one of our University’s Dining halls – Chef Mike’s Sub Shop. It is really quite fantastic – spicy sausage, broccoli rabe, parmesan flakes – all for the low price of one dining swipe. To show my dedication to the cause, and to connect with my other grandma-heads, I built dotheyhavethegrandmasub.com. This site is any grandma-head’s one-stop-shop for all things grandma sub. The website updates each day by scraping our dining website’s menu. This was no easy task, as the dining website is encrypted under CORS protocol, which requires the request to first be sent through a CORS-header proxy. I hosted such a proxy on Heroku. Upon receiving the HTML of the dining website, I parse the JSON data until finding today’s menu, and checking if the grandma sub was on it. This was written in React, Tailwind CSS, Typescript, and uses Axios to send the fetch HTTP request.",
            "url": "https://www.dotheyhavethegrandmasub.com/",
            "skills": ["React", "Implementing Design", "Typescript", "Tailwind CSS", "HTML/CSS"],
            "imgSlugs": ["chefmike1.jpg", "chefmike2.png"]
        },
        {
            "entryId": 8,
            "name": "Polyphonic Drum Machine",
            "blurb": "A great love of mine is music. After taking Computational Sound, a class where I learned about sound wave synthesis, plug-in effects, and live coding, I decided to build a project using what I had learned. This is a polyphonic drum machine, which plays each sound track on a different time-signature. This creates really unique sound combinations and environments. This was created using the Javascript WebAudio library, which was a headache to work with as it was just so old. The site was constructed using React, Typescript, and Tailwind CSS. ",
            "url": "https://main.d2zyhjidm5l1wk.amplifyapp.com/",
            "skills": ["React", "Implementing Design", "Typescript", "Tailwind CSS", "HTML/CSS"],
            "imgSlugs": ["dm1.png"]
        },
        {
            "entryId": 9,
            "name": "Delia's Site",
            "blurb": "Delia is a tattoo artist based in the UWS of NYC. I worked with her through several design iterations before settling on the design as it exists now. The central menu involves a vinyl disk that slowly spins on screen, with links rotating with it. The site includes her flash sheets, a portfolio, and a booking link where a user can contact her and schedule a tattoo. Currently waiting on her to complete some assets to add to the site before launching. ",
            "skills": ["React", "Implementing Design", "Typescript", "Tailwind CSS", "HTML/CSS"],
            "imgSlugs": ["delia1.png", "delia2.png"]
        },
        {
            "entryId": 2,
            "name": "Personal Website Frontend",
            "blurb": "This is the website you are currently on! I built this website using React, Typescript, and TailwindCSS. I wrote several different node scripts, including a deploy script that automatically builds and publishes the changes to Git Pages. I designed this site on Figma, and created two designs for each page: one for mobile and one for desktop. Using the TailwindCSS breakpoints, I was able to change the design of the site responsively to the window size. ",
            "url": "https://github.com/andyjwang19/PersonalSite",
            "skills": ["React", "Implementing Design", "Typescript", "Tailwind CSS", "HTML/CSS"],
            "imgSlugs": [
                "ps_frontend1.png",
                "ps_frontend2.png",
                "ps_frontend3.png",
                "ps_frontend4.png"
            ]
        },
        {
            "entryId": 3,
            "name": "Personal Website Backend",
            "blurb": "I created a backend for my personal website to serve data on various portfolio elements. This was written in NodeJS and ExpressJS, and hosted on AWS EC2. This backend was connected to the front end through a REST API, called through HTTP requests.",
            "url": "https://github.com/andyjwang19/PersonalSite/tree/main/server",
            "skills": [],
            "imgSlugs": ["placeholder.png"]
        },
        {
            "entryId": 4,
            "name": "Accolades for The Vendry",
            "blurb": "As a capstone project for my Internship at The Vendry, I added an Accolade System to their search. The Vendry has several services, the primary one being their venue search, which allows hosts and companies to look through a carefully curated dataset of venues. An important aspect of the users' evaluations of a particular venue would be any awards the venue has won. This is the service I added. I worked on the full-stack of this service, from creating and designing the database to store necessary values, writing API paths for the frontend to get the values from the backend, to a front end display. The Frontend display included an option in the search bar for all users to see, as well as an inward facing interface for admins to manipulate the database.",
            "skills": ["React", "APIs", "Full-Stack", "Implementing Design", "Typescript"],
            "imgSlugs": ["placeholder.png"]
        },
        {
            "entryId": 5,
            "name": "Website Portfolio Engine",
            "blurb": "I designed this engine to automate the layout of a site, combining differently sized elements. The different elements are sorted in Small, Medium, and Large based on the length of the blurbs, before the algorithm mixes and matches to form an interesting layout. ",
            "skills": ["Algorithm Design", "React", "Typescript", "Tailwind CSS", "HTML/CSS"],
            "imgSlugs": ["placeholder.png"]
        }
    ]
}
