[
    {
        "name": "HotSpot Design",
        "imgSlug": "hotspotDesign",
        "blurb": "This design involved several iterations of prototyping and running user tests. I experimented with several versions, and ran them by groups of users. I landed on this final design, and made several mockups in Figma.",
        "type": "UI",
        "skills": ["Figma", "Prototyping", "Mobile Design"]
    },
    {
        "name": "Inside Out Radio Station",
        "imgSlug": "insideOutRadio",
        "blurb": "This was the final project for the Architecture class Systems and Materials. In this project, I flipped a physical space I was familiar with, the Columbia Radio Station, inside out. Upon this exploration, I discovered several relationships and connections that I solidified into this model, making considerations on material and construction process.",
        "type": "Architecture",
        "skills": [
            "Rhino Modelling",
            "Adobe Illustrator",
            "Adobe InDesign",
            "Laser Cutting",
            "Physical Modelling",
            "Prototyping"
        ]
    },
    {
        "name": "Lunar New Year Poster",
        "imgSlug": "lnyposter",
        "blurb": "In this poster, I worked on developing my own style, as well as more skills with Adobe Illustrator. I was inspired by maximalist works I had recently seen, and intended to make something that was simultaneously sensorily overwhelming and cohesive.                                                                                                                                ",
        "type": "Graphic",
        "skills": ["Adobe Illustrator"]
    },
    {
        "name": "Social System Chair",
        "imgSlug": "socialSystemChair",
        "blurb": "This was my first exploration into Architecture. In this project, I identified a social system in my personali life, that of the mailroom line that invovled two queues that crossed each other. I designed this chair to change up that social system, changing the intersection into a round-a-bout type interaction.",
        "type": "Architecture",
        "skills": ["Rhino Modelling", "Adobe Illustrator", "Adobe InDesign"]
    },
    {
        "name": "Got Milk? Poster",
        "imgSlug": "gotmilk",
        "blurb": "My purpose with this design was to embrace the generational trend toward a more absurdist humor and worldview. Technically, this was an exercise of logo-making and illustrative design.",
        "type": "Graphic",
        "skills": ["Adobe Illustrator"]
    },
    {
        "name": "Personal Website",
        "imgSlug": "personalWebsite",
        "blurb": "I designed this website on Figma before developing and deploying it. Here, I worked on the most visually-appealing way to display information I was very familiar with.",
        "type": "UI",
        "skills": ["Figma", "Prototyping", "Colors"]
    }
]
